In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

### 연습 문제 4.1.1

#### (1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

In [16]:
s1 = pd.Series([1,2,3,4],
              index=["a", "b", "c", "d"])
s2 = pd.Series([10,22,30,44],
              index=["a", "b", "c", "e"])

#### (2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [17]:
s1 + s2

a    11.0
b    24.0
c    33.0
d     NaN
e     NaN
dtype: float64

In [18]:
s1 - s2

a    -9.0
b   -20.0
c   -27.0
d     NaN
e     NaN
dtype: float64

In [19]:
s1 * s2

a    10.0
b    44.0
c    90.0
d     NaN
e     NaN
dtype: float64

In [20]:
s1 / s2

a    0.100000
b    0.090909
c    0.100000
d         NaN
e         NaN
dtype: float64

### 연습 문제 4.1.2

#### 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
- (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
- (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [22]:
data = {
    "A": [0, 1, 2, 3, 4],
    "B": ["h", "e", "l", "l", "o"],
    "C": [1.5, 2.5, 7.7, 8.3, 3.9],
    "D": ["새벽", "아침", "점심", "저녁", "없음"],
    "E": [11, 21, 31, 41, 51]  
}

df = pd.DataFrame(data)
df

   A  B    C   D   E
0  0  h  1.5  새벽  11
1  1  e  2.5  아침  21
2  2  l  7.7  점심  31
3  3  l  8.3  저녁  41
4  4  o  3.9  없음  51

### 연습 문제 4.1.3

#### 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [31]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df413 = pd.DataFrame(data, index=index, columns=columns)

In [32]:
df413

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [33]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
s = df413['수학']
s

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [34]:
type(s)    # 시리즈임을 확인

pandas.core.series.Series

In [35]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
d = df413[['국어','영어']]
d

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [36]:
type(d)     # 데이터프레임임을 확인

pandas.core.frame.DataFrame

In [37]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df413["평균"] = ((df413["국어"] + df413["영어"] + df413["수학"]) / 3 ).round(2)
df413

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [38]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df413["영어"]["방자"] = 80
df413["평균"] = ((df413["국어"] + df413["영어"] + df413["수학"]) / 3 ).round(2)
df413

C:\Users\kimee\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [39]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df413[0:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [46]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df413.iloc[2]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

### 연습 문제 4.3.1

#### (1) 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

In [24]:
df2 = pd.DataFrame(np.random.randint(10, size=(5, 5)), dtype = int,
                    index = ["a", "b", "c", "d", "e"],
                    columns = ["A", "B", "C", "D", "E"])
df2

   A  B  C  D  E
a  1  0  0  2  5
b  3  4  6  3  2
c  4  6  4  7  6
d  0  8  9  0  4
e  6  1  0  3  2

#### (2) 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [25]:
# 1)
df2.iloc[0]

A    1
B    0
C    0
D    2
E    5
Name: a, dtype: int32

In [27]:
# 2)
df2.iloc[:1]

   A  B  C  D  E
a  1  0  0  2  5

In [30]:
# 3)
df2.iloc[:1, :5]

   A  B  C  D  E
a  1  0  0  2  5

In [32]:
# 4)
df2.loc[:'a']

   A  B  C  D  E
a  1  0  0  2  5

In [45]:
# 5)
df2.loc[:'a', :]

   A  B  C  D  E
a  1  0  0  2  5

In [33]:
# 6)
df2.loc['a']

A    1
B    0
C    0
D    2
E    5
Name: a, dtype: int32

In [35]:
# 7)
df2.loc[df2.B == 0]

   A  B  C  D  E
a  1  0  0  2  5

In [55]:
# 8) 
df2.loc[df2.A < 2][:'c']

   A  B  C  D  E
a  1  0  0  2  5

In [46]:
# 9)
df2[:'a']

   A  B  C  D  E
a  1  0  0  2  5

In [56]:
# 10)
df2[:1]

   A  B  C  D  E
a  1  0  0  2  5

### 연습 문제 4.4.1

In [31]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [58]:
# 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### 연습 문제 4.4.2

In [59]:
# sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.
# 성별 인원수
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [60]:
# 나이별 인원수
titanic.age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [61]:
# 선실별 인원수
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [62]:
# 사망/생존 인원수
titanic['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

### 연습 문제 4.4.3

#### (1) 타이타닉호 승객의 평균 나이를 구하라.

In [63]:
titanic['age'].mean(axis=0)

29.69911764705882

#### (2) 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

In [73]:
female = titanic.loc[titanic.sex == "female"]
female['age'].mean(axis = 0) # 여성 승객 나이의 평균 구하기

27.915708812260537

In [75]:
## 다른 방법 ##
female2 = titanic[titanic['sex'] == 'female'] 
female2['age'].mean(axis=0)

27.915708812260537

#### 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [78]:
# 여성 승객 데이터 프레임에서 필터링하기
first = female.loc[female['class'] == "First"]

# 1등실 선실의 여성 승객의 평균 나이를 구하기
first['age'].mean(axis=0)

34.61176470588235

### 연습 문제 4.4.4

#### 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.
- 20살이 넘으면 성별을 그대로 사용한다.
- 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [19]:
titanic["category1"] = titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

### 연습 문제 4.4.5

#### 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [79]:
round(titanic.mean()['age'])

30

In [32]:
titanic["age"].fillna(30, inplace=True)

### 연습문제 4.4.6

#### 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.

- (1) 성별을 나타내는 문자열 male 또는 female로 시작한다.
- (2) 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
- (3) 예를 들어 27살 남성은 male27 값이 된다.

In [18]:
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
category2        object
dtype: object

In [33]:
titanic.age.astype(int)

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    30
889    26
890    32
Name: age, Length: 891, dtype: int32

In [37]:
titanic['category2'] = titanic.sex + titanic.age.astype(int).astype(str)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category2
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male27
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,female19
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female30
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male26
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male32

### 연습문제 4.4.7

#### 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다. 그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [42]:
type(titanic['age'])

pandas.core.series.Series

In [82]:
# age시리즈를 리스트로 변환
age_list = titanic["age"].tolist()

In [84]:
ages = age_list
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels = labels)
cats

['청년', '중년', '청년', '중년', '중년', ..., '청년', '미성년자', '청년', '청년', '중년']
Length: 891
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [85]:
pd.value_counts(cats)

청년      407
중년      241
미성년자    165
장년       59
노년        5
dtype: int64

In [86]:
# 비율 구하기
n=891
s = pd.Series([407,241,165,59,5],
                index=['청년','중년','미성년자','장년','노년'])
s/891

청년      0.456790
중년      0.270483
미성년자    0.185185
장년      0.066218
노년      0.005612
dtype: float64

### 연습문제 4.4.8

#### 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.

- (1) 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.
- (2) 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

In [95]:
titanic["category3"] = titanic.apply(lambda r: f'노년,{r.sex}' if r.age>=70 else f'장년,{r.sex}' if r.age>=50 else f'중년,{r.sex}' if r.age>=30 else f'청년,{r.sex}' if r.age>=20 else "미성년자", axis=1)

titanic.tail(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category3
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,"중년,male"
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True,"청년,female"
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True,"청년,male"
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True,"청년,male"
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,"중년,female"
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,"청년,male"
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,미성년자
888,0,3,female,30.0,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,"중년,female"
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,"청년,male"
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,"중년,male"

### 연습 문제 4.5.1

#### 5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

- (1) 학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 일반 데이터열로 바꾸어 데이터프레임 df_score2을 만든다.
- (2) 학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [101]:
data = {
    "국어": [99, 34, 50, 79, 88],
    "영어": [96, 33, 26, 77, 56],
    "수학": [97, 35, 68, 55, 89],
}

columns = ['국어', '영어', '수학']

df_score1 = pd.DataFrame(data,columns = columns)
df_score1

   국어  영어  수학
0  99  96  97
1  34  33  35
2  50  26  68
3  79  77  55
4  88  56  89

In [102]:
# df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정
df_score1.index = ['영서','민수','희수','찬열','아영']
df_score1.index.name = "이름"
df_score1

    국어  영어  수학
이름
영서  99  96  97
민수  34  33  35
희수  50  26  68
찬열  79  77  55
아영  88  56  89

In [108]:
# reset_index 명령으로 인덱스 열을 일반 데이터열로 바꾸어 df_score2만들기
df_score2 = df_score1.reset_index()
df_score2

   이름  국어  영어  수학
0  영서  99  96  97
1  민수  34  33  35
2  희수  50  26  68
3  찬열  79  77  55
4  아영  88  56  89

In [111]:
# 학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.
df_score_new = df_score2.set_index("이름")
df_score_new

    국어  영어  수학
이름
영서  99  96  97
민수  34  33  35
희수  50  26  68
찬열  79  77  55
아영  88  56  89

### 연습문제 4.5.2

#### A 반 학생 5명과 B반 학생 5명의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

- (1) “반”, “번호”, “국어”, “영어”, “수학” 을 열로 가지는 데이터프레임 df_score3을 만든다.

In [126]:
np.random.randint(0,100,10)

array([24,  3, 83, 45, 33, 76, 65, 60, 87, 93])

In [151]:
data2 = {
    "반":["A",'A','A','A','A','B','B','B','B','B'],
    "번호":[1,2,3,4,5,1,2,3,4,5],     
    "국어": [99, 34, 50, 79, 88, 34,23,57,25,83],
    "영어": [96, 33, 26, 77, 56, 72,48,68,64,68],
    "수학": [97, 35, 68, 55, 89, 90,53,57,63,26],
}

columns =  ["반","번호",'국어', '영어', '수학'] 

df_score3 = pd.DataFrame(data2, columns = columns)
df_score3

   반  번호  국어  영어  수학
0  A   1  99  96  97
1  A   2  34  33  35
2  A   3  50  26  68
3  A   4  79  77  55
4  A   5  88  56  89
5  B   1  34  72  90
6  B   2  23  48  53
7  B   3  57  68  57
8  B   4  25  64  63
9  B   5  83  68  26

- (2) df_score3을 변형하여 1차 행 인덱스로 “반”을 2차 행 인덱스로 “번호”을 가지는 데이터프레임 df_score4을 만든다.

In [152]:
df_score4 = df_score3.set_index(['반','번호'])
df_score4

      국어  영어  수학
반 번호
A 1   99  96  97
  2   34  33  35
  3   50  26  68
  4   79  77  55
  5   88  56  89
B 1   34  72  90
  2   23  48  53
  3   57  68  57
  4   25  64  63
  5   83  68  26

- (3) 데이터 프레임 df_score4에 각 학생의 평균을 나타내는 행을 오른쪽에 추가한다.

In [153]:
df_score4['평균'] = df_score4.mean(axis=1)
df_score4

      국어  영어  수학         평균
반 번호
A 1   99  96  97  97.333333
  2   34  33  35  34.000000
  3   50  26  68  48.000000
  4   79  77  55  70.333333
  5   88  56  89  77.666667
B 1   34  72  90  65.333333
  2   23  48  53  41.333333
  3   57  68  57  60.666667
  4   25  64  63  50.666667
  5   83  68  26  59.000000

- (4) df_score3을 변형하여 행 인덱스로 “번호”를, 1차 열 인덱스로 “국어”, “영어”, “수학”을, 2차 열 인덱스로 “반”을 가지는 데이터프레임 df_score5을 만든다.

In [154]:
df_score5 = df_score3.set_index(['반','번호']).unstack("반")
df_score5

    국어      영어      수학
반    A   B   A   B   A   B
번호
1   99  34  96  72  97  90
2   34  23  33  48  35  53
3   50  57  26  68  68  57
4   79  25  77  64  55  63
5   88  83  56  68  89  26

- (5) 데이터 프레임 df_score5에 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가한다.

In [156]:
df_score5.loc['avg'] =  df_score5.mean(axis=0)
df_score5

       국어          영어          수학
반       A     B     A     B     A     B
번호
1    99.0  34.0  96.0  72.0  97.0  90.0
2    34.0  23.0  33.0  48.0  35.0  53.0
3    50.0  57.0  26.0  68.0  68.0  57.0
4    79.0  25.0  77.0  64.0  55.0  63.0
5    88.0  83.0  56.0  68.0  89.0  26.0
avg  70.0  44.4  57.6  64.0  68.8  57.8